Autodesk.Revit.DB.FormaRoadRegions.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.FormaRoadRegions.#ctor(System.Collections.Generic.IList{System.Collections.Generic.IList{Autodesk.Revit.DB.UV}},System.Collections.Generic.IList{System.Int32})
Construct from the flattened loops and region offsets.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2027

Autodesk.Revit.DB.FormaRoadRegions
Per-road footprint polygons for terrain clamping. Stored as a flat list of closed loops
plus per-region start offsets: region i owns loops[regionStarts[i] .. regionStarts[i+1]).
The first loop of each region is the outer contour; the rest are holes (e.g. a closed-road
annulus). regionStarts has a trailing sentinel equal to the loop count.
Since:
2027